panda-official/TimeSwipe/src/3rdparty/same54/gcc/startup_ARMCM4_E54.S
/* File: startup_ARMCM4.S
 * Purpose: startup file for Cortex-M4 devices. Should use with
 *   GCC for ARM Embedded Processors
 * Version: V2.0
 * Date: 16 August 2013
 *
 * Copyright (c) 2011 - 2013 ARM LIMITED

   All rights reserved.
   Redistribution and use in source and binary forms, with or without
   modification, are permitted provided that the following conditions are met:
   - Redistributions of source code must retain the above copyright
     notice, this list of conditions and the following disclaimer.
   - Redistributions in binary form must reproduce the above copyright
     notice, this list of conditions and the following disclaimer in the
     documentation and/or other materials provided with the distribution.
   - Neither the name of ARM nor the names of its contributors may be used
     to endorse or promote products derived from this software without
     specific prior written permission.
   *
   THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
   AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
   IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
   ARE DISCLAIMED. IN NO EVENT SHALL COPYRIGHT HOLDERS AND CONTRIBUTORS BE
   LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
   CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
   SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
   INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
   CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
   ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
   POSSIBILITY OF SUCH DAMAGE.
*/

/*--------------------------13.07.2019---------------------------------
  This file was edited by VNK to:
  add SAME54 external interrupts handlers: locs 97-233
  Panda Team
  ---------------------------------------------------------------------*/

	.syntax	unified
	.arch	armv7e-m

	.section .stack
	.align	3
#ifdef __STACK_SIZE
	.equ	Stack_Size, __STACK_SIZE
#else
	.equ	Stack_Size, 0xc00
#endif
	.globl	__StackTop
	.globl	__StackLimit
__StackLimit:
	.space	Stack_Size
	.size	__StackLimit, . - __StackLimit
__StackTop:
	.size	__StackTop, . - __StackTop

	.section .heap
	.align	3
#ifdef __HEAP_SIZE
	.equ	Heap_Size, __HEAP_SIZE
#else
	.equ	Heap_Size, 0
#endif
	.globl	__HeapBase
	.globl	__HeapLimit
__HeapBase:
	.if	Heap_Size
	.space	Heap_Size
	.endif
	.size	__HeapBase, . - __HeapBase
__HeapLimit:
	.size	__HeapLimit, . - __HeapLimit

	.section .isr_vector
	.align	2
	.globl	__isr_vector
__isr_vector:
	.long	__StackTop            /* Top of Stack */
	.long	Reset_Handler         /* Reset Handler */
	.long	NMI_Handler           /* NMI Handler */
	.long	HardFault_Handler     /* Hard Fault Handler */
	.long	MemManage_Handler     /* MPU Fault Handler */
	.long	BusFault_Handler      /* Bus Fault Handler */
	.long	UsageFault_Handler    /* Usage Fault Handler */
	.long	0                     /* Reserved */
	.long	0                     /* Reserved */
	.long	0                     /* Reserved */
	.long	0                     /* Reserved */
	.long	SVC_Handler           /* SVCall Handler */
	.long	DebugMon_Handler      /* Debug Monitor Handler */
	.long	0                     /* Reserved */
	.long	PendSV_Handler        /* PendSV Handler */
	.long	SysTick_Handler       /* SysTick Handler */

	/* External interrupts */

        .long	PM_Handler
        .long	MCLK_Handler
        .long	OSCCTRL_0_Handler
        .long	OSCCTRL_1_Handler
        .long	OSCCTRL_2_Handler
        .long	OSCCTRL_3_Handler
        .long	OSCCTRL_4_Handler
        .long	OSC32KCTRL_Handler
        .long	SUPC_0_Handler
        .long	SUPC_1_Handler
        .long	WDT_Handler
        .long	RTC_Handler
        .long	EIC_0_Handler
        .long	EIC_1_Handler
        .long	EIC_2_Handler
        .long	EIC_3_Handler
        .long	EIC_4_Handler
        .long	EIC_5_Handler
        .long	EIC_6_Handler
        .long	EIC_7_Handler
        .long	EIC_8_Handler
        .long	EIC_9_Handler
        .long	EIC_10_Handler
        .long	EIC_11_Handler
        .long	EIC_12_Handler
        .long	EIC_13_Handler
        .long	EIC_14_Handler
        .long	EIC_15_Handler
        .long	FREQM_Handler
        .long	NVMCTRL_0_Handler
        .long	NVMCTRL_1_Handler
        .long	DMAC_0_Handler
        .long	DMAC_1_Handler
        .long	DMAC_2_Handler
        .long	DMAC_3_Handler
        .long	DMAC_4_Handler
        .long	EVSYS_0_Handler
        .long	EVSYS_1_Handler
        .long	EVSYS_2_Handler
        .long	EVSYS_3_Handler
        .long	EVSYS_4_Handler
        .long	PAC_Handler
        .long	TAL_0_Handler
        .long	TAL_1_Handler
        .long   0               //reserved!!!
        .long	RAMECC_Handler
        .long	SERCOM0_0_Handler
        .long	SERCOM0_1_Handler
        .long	SERCOM0_2_Handler
        .long	SERCOM0_3_Handler
        .long	SERCOM1_0_Handler
        .long	SERCOM1_1_Handler
        .long	SERCOM1_2_Handler
        .long	SERCOM1_3_Handler
        .long	SERCOM2_0_Handler
        .long	SERCOM2_1_Handler
        .long	SERCOM2_2_Handler
        .long	SERCOM2_3_Handler
        .long	SERCOM3_0_Handler
        .long	SERCOM3_1_Handler
        .long	SERCOM3_2_Handler
        .long	SERCOM3_3_Handler
        .long	SERCOM4_0_Handler
        .long	SERCOM4_1_Handler
        .long	SERCOM4_2_Handler
        .long	SERCOM4_3_Handler
        .long	SERCOM5_0_Handler
        .long	SERCOM5_1_Handler
        .long	SERCOM5_2_Handler
        .long	SERCOM5_3_Handler
        .long	SERCOM6_0_Handler
        .long	SERCOM6_1_Handler
        .long	SERCOM6_2_Handler
        .long	SERCOM6_3_Handler
        .long	SERCOM7_0_Handler
        .long	SERCOM7_1_Handler
        .long	SERCOM7_2_Handler
        .long	SERCOM7_3_Handler
        .long	CAN0_Handler
        .long	CAN1_Handler
        .long	USB_0_Handler
        .long	USB_1_Handler
        .long	USB_2_Handler
        .long	USB_3_Handler
        .long	GMAC_Handler
        .long	TCC0_0_Handler
        .long	TCC0_1_Handler
        .long	TCC0_2_Handler
        .long	TCC0_3_Handler
        .long	TCC0_4_Handler
        .long	TCC0_5_Handler
        .long	TCC0_6_Handler
        .long	TCC1_0_Handler
        .long	TCC1_1_Handler
        .long	TCC1_2_Handler
        .long	TCC1_3_Handler
        .long	TCC1_4_Handler
        .long	TCC2_0_Handler
        .long	TCC2_1_Handler
        .long	TCC2_2_Handler
        .long	TCC2_3_Handler
        .long	TCC3_0_Handler
        .long	TCC3_1_Handler
        .long	TCC3_2_Handler
        .long	TCC4_0_Handler
        .long	TCC4_1_Handler
        .long	TCC4_2_Handler
        .long	TC0_Handler
        .long	TC1_Handler
        .long	TC2_Handler
        .long	TC3_Handler
        .long	TC4_Handler
        .long	TC5_Handler
        .long	TC6_Handler
        .long	TC7_Handler
        .long	PDEC_0_Handler
        .long	PDEC_1_Handler
        .long	PDEC_2_Handler
        .long	ADC0_0_Handler
        .long	ADC0_1_Handler
        .long	ADC1_0_Handler
        .long	ADC1_1_Handler
        .long	AC_Handler
        .long	DAC_0_Handler
        .long	DAC_1_Handler
        .long	DAC_2_Handler
        .long	DAC_3_Handler
        .long	DAC_4_Handler
        .long	I2S_Handler
        .long	PCC_Handler
        .long	AES_Handler
        .long	TRNG_Handler
        .long	ICM_Handler
        .long	PUKCC_Handler
        .long	QSPI_Handler
        .long	SDHC0_Handler
        .long	SDHC1_Handler

	.size	__isr_vector, . - __isr_vector

	.text
	.thumb
	.thumb_func
	.align	2
	.globl	Reset_Handler
	.type	Reset_Handler, %function
Reset_Handler:
/*  Firstly it copies data from read only memory to RAM. There are two schemes
 *  to copy. One can copy more than one sections. Another can only copy
 *  one section.  The former scheme needs more instructions and read-only
 *  data to implement than the latter.
 *  Macro __STARTUP_COPY_MULTIPLE is used to choose between two schemes.  */

#ifdef __STARTUP_COPY_MULTIPLE
/*  Multiple sections scheme.
 *
 *  Between symbol address __copy_table_start__ and __copy_table_end__,
 *  there are array of triplets, each of which specify:
 *    offset 0: LMA of start of a section to copy from
 *    offset 4: VMA of start of a section to copy to
 *    offset 8: size of the section to copy. Must be multiply of 4
 *
 *  All addresses must be aligned to 4 bytes boundary.
 */
	ldr	r4, =__copy_table_start__
	ldr	r5, =__copy_table_end__

.L_loop0:
	cmp	r4, r5
	bge	.L_loop0_done
	ldr	r1, [r4]
	ldr	r2, [r4, #4]
	ldr	r3, [r4, #8]

.L_loop0_0:
	subs	r3, #4
	ittt	ge
	ldrge	r0, [r1, r3]
	strge	r0, [r2, r3]
	bge	.L_loop0_0

	adds	r4, #12
	b	.L_loop0

.L_loop0_done:
#else
/*  Single section scheme.
 *
 *  The ranges of copy from/to are specified by following symbols
 *    __etext: LMA of start of the section to copy from. Usually end of text
 *    __data_start__: VMA of start of the section to copy to
 *    __data_end__: VMA of end of the section to copy to
 *
 *  All addresses must be aligned to 4 bytes boundary.
 */
	ldr	r1, =__etext
	ldr	r2, =__data_start__
	ldr	r3, =__data_end__

.L_loop1:
	cmp	r2, r3
	ittt	lt
	ldrlt	r0, [r1], #4
	strlt	r0, [r2], #4
	blt	.L_loop1
#endif /*__STARTUP_COPY_MULTIPLE */

/*  This part of work usually is done in C library startup code. Otherwise,
 *  define this macro to enable it in this startup.
 *
 *  There are two schemes too. One can clear multiple BSS sections. Another
 *  can only clear one section. The former is more size expensive than the
 *  latter.
 *
 *  Define macro __STARTUP_CLEAR_BSS_MULTIPLE to choose the former.
 *  Otherwise efine macro __STARTUP_CLEAR_BSS to choose the later.
 */
#ifdef __STARTUP_CLEAR_BSS_MULTIPLE
/*  Multiple sections scheme.
 *
 *  Between symbol address __copy_table_start__ and __copy_table_end__,
 *  there are array of tuples specifying:
 *    offset 0: Start of a BSS section
 *    offset 4: Size of this BSS section. Must be multiply of 4
 */
	ldr	r3, =__zero_table_start__
	ldr	r4, =__zero_table_end__

.L_loop2:
	cmp	r3, r4
	bge	.L_loop2_done
	ldr	r1, [r3]
	ldr	r2, [r3, #4]
	movs	r0, 0

.L_loop2_0:
	subs	r2, #4
	itt	ge
	strge	r0, [r1, r2]
	bge	.L_loop2_0

	adds	r3, #8
	b	.L_loop2
.L_loop2_done:
#elif defined (__STARTUP_CLEAR_BSS)
/*  Single BSS section scheme.
 *
 *  The BSS section is specified by following symbols
 *    __bss_start__: start of the BSS section.
 *    __bss_end__: end of the BSS section.
 *
 *  Both addresses must be aligned to 4 bytes boundary.
 */
	ldr	r1, =__bss_start__
	ldr	r2, =__bss_end__

	movs	r0, 0
.L_loop3:
	cmp	r1, r2
	itt	lt
	strlt	r0, [r1], #4
	blt	.L_loop3
#endif /* __STARTUP_CLEAR_BSS_MULTIPLE || __STARTUP_CLEAR_BSS */

#ifndef __NO_SYSTEM_INIT
	bl	SystemInit
#endif

#ifndef __START
#define __START _start
#endif
	bl	__START

	.pool
	.size	Reset_Handler, . - Reset_Handler

	.align	1
	.thumb_func
	.weak	Default_Handler
	.type	Default_Handler, %function
Default_Handler:
	b	.
	.size	Default_Handler, . - Default_Handler

/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
	.macro	def_irq_handler	handler_name
	.weak	\handler_name
	.set	\handler_name, Default_Handler
	.endm

	def_irq_handler	NMI_Handler
	def_irq_handler	HardFault_Handler
	def_irq_handler	MemManage_Handler
	def_irq_handler	BusFault_Handler
	def_irq_handler	UsageFault_Handler
	def_irq_handler	SVC_Handler
	def_irq_handler	DebugMon_Handler
	def_irq_handler	PendSV_Handler
	def_irq_handler	SysTick_Handler
        /*def_irq_handler	DEF_IRQHandler*/

        def_irq_handler	PM_Handler
        def_irq_handler	MCLK_Handler
        def_irq_handler	OSCCTRL_0_Handler
        def_irq_handler	OSCCTRL_1_Handler
        def_irq_handler	OSCCTRL_2_Handler
        def_irq_handler	OSCCTRL_3_Handler
        def_irq_handler	OSCCTRL_4_Handler
        def_irq_handler	OSC32KCTRL_Handler
        def_irq_handler	SUPC_0_Handler
        def_irq_handler	SUPC_1_Handler
        def_irq_handler	WDT_Handler
        def_irq_handler	RTC_Handler
        def_irq_handler	EIC_0_Handler
        def_irq_handler	EIC_1_Handler
        def_irq_handler	EIC_2_Handler
        def_irq_handler	EIC_3_Handler
        def_irq_handler	EIC_4_Handler
        def_irq_handler	EIC_5_Handler
        def_irq_handler	EIC_6_Handler
        def_irq_handler	EIC_7_Handler
        def_irq_handler	EIC_8_Handler
        def_irq_handler	EIC_9_Handler
        def_irq_handler	EIC_10_Handler
        def_irq_handler	EIC_11_Handler
        def_irq_handler	EIC_12_Handler
        def_irq_handler	EIC_13_Handler
        def_irq_handler	EIC_14_Handler
        def_irq_handler	EIC_15_Handler
        def_irq_handler	FREQM_Handler
        def_irq_handler	NVMCTRL_0_Handler
        def_irq_handler	NVMCTRL_1_Handler
        def_irq_handler	DMAC_0_Handler
        def_irq_handler	DMAC_1_Handler
        def_irq_handler	DMAC_2_Handler
        def_irq_handler	DMAC_3_Handler
        def_irq_handler	DMAC_4_Handler
        def_irq_handler	EVSYS_0_Handler
        def_irq_handler	EVSYS_1_Handler
        def_irq_handler	EVSYS_2_Handler
        def_irq_handler	EVSYS_3_Handler
        def_irq_handler	EVSYS_4_Handler
        def_irq_handler	PAC_Handler
        def_irq_handler	TAL_0_Handler
        def_irq_handler	TAL_1_Handler
        def_irq_handler	RAMECC_Handler
        def_irq_handler	SERCOM0_0_Handler
        def_irq_handler	SERCOM0_1_Handler
        def_irq_handler	SERCOM0_2_Handler
        def_irq_handler	SERCOM0_3_Handler
        def_irq_handler	SERCOM1_0_Handler
        def_irq_handler	SERCOM1_1_Handler
        def_irq_handler	SERCOM1_2_Handler
        def_irq_handler	SERCOM1_3_Handler
        def_irq_handler	SERCOM2_0_Handler
        def_irq_handler	SERCOM2_1_Handler
        def_irq_handler	SERCOM2_2_Handler
        def_irq_handler	SERCOM2_3_Handler
        def_irq_handler	SERCOM3_0_Handler
        def_irq_handler	SERCOM3_1_Handler
        def_irq_handler	SERCOM3_2_Handler
        def_irq_handler	SERCOM3_3_Handler
        def_irq_handler	SERCOM4_0_Handler
        def_irq_handler	SERCOM4_1_Handler
        def_irq_handler	SERCOM4_2_Handler
        def_irq_handler	SERCOM4_3_Handler
        def_irq_handler	SERCOM5_0_Handler
        def_irq_handler	SERCOM5_1_Handler
        def_irq_handler	SERCOM5_2_Handler
        def_irq_handler	SERCOM5_3_Handler
        def_irq_handler	SERCOM6_0_Handler
        def_irq_handler	SERCOM6_1_Handler
        def_irq_handler	SERCOM6_2_Handler
        def_irq_handler	SERCOM6_3_Handler
        def_irq_handler	SERCOM7_0_Handler
        def_irq_handler	SERCOM7_1_Handler
        def_irq_handler	SERCOM7_2_Handler
        def_irq_handler	SERCOM7_3_Handler
        def_irq_handler	CAN0_Handler
        def_irq_handler	CAN1_Handler
        def_irq_handler	USB_0_Handler
        def_irq_handler	USB_1_Handler
        def_irq_handler	USB_2_Handler
        def_irq_handler	USB_3_Handler
        def_irq_handler	GMAC_Handler
        def_irq_handler	TCC0_0_Handler
        def_irq_handler	TCC0_1_Handler
        def_irq_handler	TCC0_2_Handler
        def_irq_handler	TCC0_3_Handler
        def_irq_handler	TCC0_4_Handler
        def_irq_handler	TCC0_5_Handler
        def_irq_handler	TCC0_6_Handler
        def_irq_handler	TCC1_0_Handler
        def_irq_handler	TCC1_1_Handler
        def_irq_handler	TCC1_2_Handler
        def_irq_handler	TCC1_3_Handler
        def_irq_handler	TCC1_4_Handler
        def_irq_handler	TCC2_0_Handler
        def_irq_handler	TCC2_1_Handler
        def_irq_handler	TCC2_2_Handler
        def_irq_handler	TCC2_3_Handler
        def_irq_handler	TCC3_0_Handler
        def_irq_handler	TCC3_1_Handler
        def_irq_handler	TCC3_2_Handler
        def_irq_handler	TCC4_0_Handler
        def_irq_handler	TCC4_1_Handler
        def_irq_handler	TCC4_2_Handler
        def_irq_handler	TC0_Handler
        def_irq_handler	TC1_Handler
        def_irq_handler	TC2_Handler
        def_irq_handler	TC3_Handler
        def_irq_handler	TC4_Handler
        def_irq_handler	TC5_Handler
        def_irq_handler	TC6_Handler
        def_irq_handler	TC7_Handler
        def_irq_handler	PDEC_0_Handler
        def_irq_handler	PDEC_1_Handler
        def_irq_handler	PDEC_2_Handler
        def_irq_handler	ADC0_0_Handler
        def_irq_handler	ADC0_1_Handler
        def_irq_handler	ADC1_0_Handler
        def_irq_handler	ADC1_1_Handler
        def_irq_handler	AC_Handler
        def_irq_handler	DAC_0_Handler
        def_irq_handler	DAC_1_Handler
        def_irq_handler	DAC_2_Handler
        def_irq_handler	DAC_3_Handler
        def_irq_handler	DAC_4_Handler
        def_irq_handler	I2S_Handler
        def_irq_handler	PCC_Handler
        def_irq_handler	AES_Handler
        def_irq_handler	TRNG_Handler
        def_irq_handler	ICM_Handler
        def_irq_handler	PUKCC_Handler
        def_irq_handler	QSPI_Handler
        def_irq_handler	SDHC0_Handler
        def_irq_handler	SDHC1_Handler

	.end
